#### Terraform Plan (prod)

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:eu-north-1:982890094160:task-definition/log-analyzer-task:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-north-1:982890094160:task-definition/log-analyzer-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  ~ image            = "982890094160.dkr.ecr.eu-north-1.amazonaws.com/log-analyzer:d5aa3b95cc84" -> "982890094160.dkr.ecr.eu-north-1.amazonaws.com/log-analyzer:latest"
                  - mountPoints      = []
                    name             = "log-analyzer"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "log-analyzer-task" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Name"        = "log-analyzer-task"
            "Project"     = "log-analyzer"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
*Pushed by: @shaeed-noordeen, Action: `pull_request`*